ralphreid/w4d2/classwork/Student_solution_cookbook/app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("created_at", "image", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @ingredient = Ingredient.create(params[:ingredient])

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @ingredient = Ingredient.find(params[:id])

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT 1  [["id", "7"]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = 7
---
  def destroy
    ingredient = Ingredient.find(params[:id])
    ingredient.delete