ralphreid/w4d2/classwork/Student_solution_cookbook/app/controllers/quantities_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def new
    @recipe = Recipe.find params[:recipe_id]

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", "4"]]
INSERT INTO "quantities" ("description", "ingredient_id", "measurement", "price", "quantity", "recipe_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @recipe = Recipe.find(params[:recipe_id])
    @quantity = @recipe.quantities.build(params[:quantity])
    if @quantity.save

SELECT "quantities".* FROM "quantities" WHERE "quantities"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "quantities" WHERE "quantities"."id" = 5
---
  def destroy
    quantity = Quantity.find(params[:id])
    recipe = quantity.recipe
    puts recipe
    quantity.delete