ralphreid/w4d2/classwork/Student_solution_cookbook/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("cooktime", "course", "created_at", "image", "instructions", "name", "servingsize", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @recipe = Recipe.new(params[:recipe])
    if @recipe.save

UPDATE "recipes" SET "servingsize" = 4, "updated_at" = '2013-10-22 03:23:03.042558' WHERE "recipes"."id" = 2
---
  def update
    #@recipe = Recipe.find(params[:id])
    if @recipe.update_attributes(params[:recipe])

DELETE FROM "recipes" WHERE "recipes"."id" = 5
---
  def destroy
    #@recipe = Recipe.find(params[:id])
    @recipe.delete

UPDATE "recipes" SET "flagged" = 't', "updated_at" = '2013-10-22 03:43:11.924135' WHERE "recipes"."id" = 3
---
  def flag
    #@recipe = Recipe.find(params[:id])
    @recipe.flagged = true
    @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."flagged" = 't'
---
  def flagged
    @recipes = Recipe.where(:flagged => true).all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def find_record
    @recipe = Recipe.find(params[:id])