ralphreid/w4d2/classwork/Student_solution_cookbook/app/controllers/users_controller.rb

  def create
    @user = User.new params[:user]
    if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "role") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "gordon@gmail.com"], ["name", "gordon"], ["password_digest", "$2a$10$IWtT3LrrziOF/qgu.n4l6e8ODokfdYaEbAM1eEqRynwxdvLkJXs0y"], ["role", nil]]