ralphreid/w4d2/classwork/Student_solution_cookbook/app/views/recipes/show.html.haml

%ul.ingredients
  - @recipe.quantities.each do |quantity|
---
SELECT "quantities".* FROM "quantities" WHERE "quantities"."recipe_id" = 1