ralphreid/w4d4/classwork/gallery_app_end/app/controllers/galleries_controller.rb

  def create
    @gallery = Gallery.new(params[:gallery])

    respond_to do |format|
      if @gallery.save
---
INSERT INTO "galleries" ("address", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", "foo"], ["created_at", Tue, 22 Oct 2013 21:51:16 UTC +00:00], ["name", "foo"], ["updated_at", Tue, 22 Oct 2013 21:51:16 UTC +00:00]]