ralphreid/w4d4/classwork/gallery_app_end/app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @painting = Painting.find(params[:id])

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def edit
    @painting = Painting.find(params[:id])

INSERT INTO "paintings" ("artist", "created_at", "description", "gallery_id", "image", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @painting = Painting.new(params[:painting])

    respond_to do |format|
      if @painting.save

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "paintings" WHERE "paintings"."id" = $1  [["id", 5]]
---
  def destroy
    @painting = Painting.find(params[:id])
    @painting.destroy