ralphreid/w4d3/homework/cookbook_search_file_upload/app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("created_at", "image", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @ingredient.save

UPDATE "ingredients" SET "image" = 'crooked_river.jpg', "updated_at" = '2013-10-23 14:55:03.570988' WHERE "ingredients"."id" = 1
---
  def update
    # @ingredient = Ingredient.find(params[:id])
    @ingredient.update_attributes(params[:ingredient])

DELETE FROM "ingredients" WHERE "ingredients"."id" = 7
---
  def destroy
    # @ingredient = Ingredient.find(params[:id])
    @ingredient.delete