ralphreid/w4d2/classwork/cookbook_start/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new params[:recipe]
    if @recipe.save
---
INSERT INTO "recipes" ("cooktime", "course", "created_at", "image", "instructions", "name", "servingsize", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    # @recipe = Recipe.find(params[:id])
    if @recipe.update_attributes(params[:recipe])
---
UPDATE "recipes" SET "course" = 'Main4', "updated_at" = '2013-10-22 11:03:56.995429' WHERE "recipes"."id" = 2

  def destroy
    # recipe = Recipe.find(params[:id])
    @recipe.delete
---
DELETE FROM "recipes" WHERE "recipes"."id" = 5

  def flag
    # @recipe = Recipe.find(params[:id])
    @recipe.flagged = true
    @recipe.save
---
UPDATE "recipes" SET "flagged" = 't', "updated_at" = '2013-10-22 03:43:11.924135' WHERE "recipes"."id" = 3

  def flagged
    @recipes = Recipe.where(flagged: true).all
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."flagged" = 't'

  def find_record
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", "5"]]