ralphreid/w4d2/homework/cookbook_start/app/controllers/quantities_controller.rb

  def create
    # @recipe = Recipe.find(params[:recipe_id])
    quantity = @recipe.quantities.create(params[:quantity])
---
INSERT INTO "quantities" ("description", "ingredient_id", "measurement", "price", "quantity", "recipe_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    # @quantity = Quantity.find(params[:id])
    @quantity.delete
---
DELETE FROM "quantities" WHERE "quantities"."id" = 5