ralphreid/w4d2/homework/cookbook_start/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "role") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "gor@me.com"], ["name", "gordon"], ["password_digest", "$2a$10$kuhbS12RzBwwHUU.Y3TMuelICJGSWBflLAqIycZNq4GncbjbcFBk."], ["role", nil]]
---
  def create
    @user = User.new params[:user]
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."role" = 'admin'
---
  def admin
    @users = User.where(role: 'admin').all